Revit 2024 API
ExternalFileReference.GetPath Method
 Gets the path of the link, relative or absolute according to the link's settings
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public ModelPath GetPath()
Visual Basic
Public Function GetPath As ModelPath
Visual C++
public:
ModelPath^ GetPath()
Return Value
 The path of the link. This path will be relative for relatively-pathed links.
See Also
ExternalFileReference Class
Autodesk.Revit.DB Namespace